app/views/books/_form.html.erb

SELECT "book_genres".* FROM "book_genres" WHERE "book_genres"."book_id" = $1  [["book_id", 14]]
SELECT "genres".* FROM "genres"
---

<% @genres = Genre.all %>