app/views/books/show.html.erb


			<%= puts @connections = BookGenre.where(book_id: @book.id)  %>
---
SELECT "book_genres".* FROM "book_genres" WHERE "book_genres"."book_id" = $1  [["book_id", 14]]

					<tr>
						<td> <%= Genre.find(conn.genre_id).name %> </td>
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT 1  [["id", nil]]