app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."is_draft" = $1 AND ("books"."created_at" BETWEEN '2016-01-18' AND '2016-01-25')  [["is_draft", "f"]]
---
  def index
    @books = Book.where("created_at > ? AND is_draft = false", p(Date.today - 7).beginning_of_day)

INSERT INTO "books" ("name", "author", "context", "is_draft", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", ""], ["author", ""], ["context", ""], ["is_draft", "f"], ["user_id", 1], ["created_at", "2016-01-25 01:13:06.738829"], ["updated_at", "2016-01-25 01:13:06.738829"]]
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id

    respond_to do |format|
      if @book.save

UPDATE "books" SET "picture" = $1, "is_draft" = $2, "updated_at" = $3 WHERE "books"."id" = $4  [["picture", "18"], ["is_draft", "t"], ["updated_at", "2016-01-25 13:08:22.331743"], ["id", 16]]
---
  def update
    if is_creator?

      update_genre_connections

      respond_to do |format|
        if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = $1  [["id", 2]]
---
  def destroy
    if is_creator?

      destroy_genre_connections
      @book.destroy

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 17]]
SELECT  "books".* FROM "books"  ORDER BY "books"."id" DESC LIMIT 1
SELECT "quotes".* FROM "quotes" WHERE "quotes"."book_id" = $1  [["book_id", 1]]
---
  def set_book
    begin
      @book = Book.find(params[:id])
      @quotes = @book.quotes.all

SELECT  "genres".* FROM "genres"  ORDER BY "genres"."id" ASC LIMIT 1
SELECT "book_genres".* FROM "book_genres" WHERE "book_genres"."book_id" = $1 AND "book_genres"."genre_id" = $2  [["book_id", 14], ["genre_id", 1]]
---
  def set_genres
    begin
      @genres = Genre.all