app/controllers/panel_controller.rb

  def index
    @drafts = Book.where(is_draft: true, user_id: current_user.id)
---
SELECT "books".* FROM "books" WHERE "books"."is_draft" = $1 AND "books"."user_id" = $2  [["is_draft", "t"], ["user_id", 2]]