app/controllers/quotes_controller.rb

  def index
    @quotes = Book.find(params[:book_id]).quotes
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 1]]

  def show
    @quote = Quote.find(params[:id])
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT 1  [["id", 6]]

  def create
    book = Book.find(params[:book_id])
    if book.user == current_user
      @quote = Quote.new(text: quote_params[:text])
      @quote.user = current_user if current_user
      @quote.book = book if book

      respond_to do |format|
        if @quote.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "quotes" ("user_id", "book_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["book_id", 1], ["text", "params[:text]"], ["created_at", "2016-02-04 11:35:40.800144"], ["updated_at", "2016-02-04 11:35:40.800144"]]

  def edit
    quote = Quote.find(params[:id])
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT 1  [["id", 6]]

  def update
    @quote = Quote.find(quote_params[:id])
    if current_user == @quote.user
      book = Book.find(params[:book_id])
      respond_to do |format|
        if @quote.update_attributes(text: quote_params[:text])
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "quotes" SET "text" = $1, "updated_at" = $2 WHERE "quotes"."id" = $3  [["text", "Super quote"], ["updated_at", "2016-02-04 14:12:44.028122"], ["id", 23]]

  def destroy
    @quote = Quote.find(params[:id])
    if @quote.user == current_user
        book = Book.find(params[:book_id])
        @quote.destroy
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "quotes" WHERE "quotes"."id" = $1  [["id", 5]]